cf/DocumentJournals/ЖурналЗаказов.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.4">
	<DocumentJournal>
		<Properties>
			<Name>ЖурналЗаказов</Name>
			<RegisteredDocuments>
				<xr:Item>Document.ВнутреннийЗаказ</xr:Item>
				<xr:Item>Document.ЗаказПокупателя</xr:Item>
				<xr:Item>Document.ИнтернетЗаказПокупателя</xr:Item>
				<xr:Item>Document.ЗаказНаряд</xr:Item>
			</RegisteredDocuments>
		</Properties>
	</DocumentJournal>
</MetaDataObject>

cf/Documents/ПриходныйКассовыйОрдер.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.4">
	<Document>
		<Properties>
			<Name>ПриходныйКассовыйОрдер</Name>
			<BasedOn>
				<xr:Item>BusinessProcess.ЗаявкаПокупателя</xr:Item>
				<xr:Item>Document.ЧекККМ</xr:Item>
				<xr:Item>Document.РеализацияТоваров</xr:Item>
				<xr:Item>Document.ЗаказПокупателя</xr:Item>
				<xr:Item>Document.ЗаказНаряд</xr:Item>
				<xr:Item>Document.ИнтернетЗаказПокупателя</xr:Item>
				<xr:Item>BusinessProcess.ИнтернетЗаявка</xr:Item>
			</BasedOn>
			<Posting>Allow</Posting>
			<RegisterRecords>
				<xr:Item>AccumulationRegister.ДенежныеСредства</xr:Item>
				<xr:Item>AccumulationRegister.ОборотыДенежныхСредств</xr:Item>
				<xr:Item>AccumulationRegister.Взаиморасчеты</xr:Item>
				<xr:Item>AccumulationRegister.ДолгиПоЗаказам</xr:Item>
				<xr:Item>AccumulationRegister.ДолгиПоОтгрузкам</xr:Item>
			</RegisterRecords>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Процесс</Name>
					<Type>
						<v8:Type>cfg:BusinessProcessRef.ПродажаВРозницу</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПринятоОт</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>250</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Приложение</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>250</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВТомЧислеНДС</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>150</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Основание</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>250</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДокументОснование</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.РеализацияТоваров</v8:Type>
						<v8:Type>cfg:DocumentRef.ЗаказПокупателя</v8:Type>
						<v8:Type>cfg:DocumentRef.ЗаказНаряд</v8:Type>
						<v8:Type>cfg:DocumentRef.ИнтернетЗаказПокупателя</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СтатьяДДС</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СтатьиДвиженияДенежныхСредств</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЗаНеучтенныйТовар</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВидОперации</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ВидыОперацийПКО</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СтатьяДДСБух</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СтатьиДвиженияДенежныхСредств</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПроведеноПоККТ</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>РасшифровкаСуммы</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Заказ</Name>
							<Type>
								<v8:Type>cfg:DocumentRef.ЗаказПокупателя</v8:Type>
								<v8:Type>cfg:DocumentRef.ЗаказНаряд</v8:Type>
								<v8:Type>cfg:DocumentRef.ИнтернетЗаказПокупателя</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ДокументОтгрузки</Name>
							<Type>
								<v8:Type>cfg:DocumentRef.РеализацияТоваров</v8:Type>
								<v8:Type>cfg:DocumentRef.РеализацияПереданныхТоваров</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Сумма</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

cf/DocumentJournals/ЖурналЗаказов/Forms/ФормаСписка/Ext/Form/Module.bsl
&НаСервере
Процедура ОбновитьПараметрыВремени()
	
	ТекДата = ТекущаяДата();
	
	//Список.Параметры.УстановитьЗначениеПараметра("ЗаЧас", 			ТекДата - 3600);
	//Список.Параметры.УстановитьЗначениеПараметра("За3Часа", 		ТекДата - 3600 * 3);
	//Список.Параметры.УстановитьЗначениеПараметра("Сегодня", 		НачалоДня(ТекДата));
	//Список.Параметры.УстановитьЗначениеПараметра("Вчера", 			НачалоДня(НачалоДня(ТекДата) - 1));
	//Список.Параметры.УстановитьЗначениеПараметра("Неделя", 			НачалоНедели(ТекДата));
	//Список.Параметры.УстановитьЗначениеПараметра("ПрошлаяНеделя", 	НачалоНедели(НачалоНедели(ТекДата) - 1));
	//Список.Параметры.УстановитьЗначениеПараметра("ЭтотМесяц", 		НачалоМесяца(ТекДата));
	//Список.Параметры.УстановитьЗначениеПараметра("ВПрошломМесяце", 	НачалоМесяца(НачалоМесяца(ТекДата) - 1));
	//Список.Параметры.УстановитьЗначениеПараметра("ВЭтотГод", 		НачалоГода(ТекДата));
	
	//Список.Параметры.УстановитьЗначениеПараметра("ПустаяДата", 	'00010101');
	//Список.Параметры.УстановитьЗначениеПараметра("ТекущаяДата", ТекДата);
	//Список.Параметры.УстановитьЗначениеПараметра("НачалоИсчесления", '20120401');

	ТекстИнфо = "Сформировано в " + Формат(ТекДата,"ДЛФ=T");
	
КонецПроцедуры

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	ОбновитьПараметрыВремени();
		
КонецПроцедуры

&НаСервере
Функция ПолучитьПроцесс(ИмяПроцесса, СсылкаЗаказ)
	
	Запрос = Новый Запрос("
	|ВЫБРАТЬ ПЕРВЫЕ 1 Ссылка
	|ИЗ БизнесПроцесс." + ИмяПроцесса + "
	|ГДЕ Заказ = &Заказ
	|");
	
	Запрос.УстановитьПараметр("Заказ", СсылкаЗаказ);
	
	Выборка = Запрос.Выполнить().Выбрать();
	Если Выборка.Следующий() Тогда
		
		Возврат Выборка.Ссылка;
		
	КонецЕсли;
	
КонецФункции
&НаКлиенте
Процедура СписокВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	
	ИмяПроцесса = Элементы.Список.ТекущиеДанные.ИмяПроцесса;
	
	Если Не ПустаяСтрока(ИмяПроцесса) Тогда
		
		Процесс = ПолучитьПроцесс(ИмяПроцесса, ВыбраннаяСтрока);
		Если Процесс <> Неопределено Тогда
			
			СтандартнаяОбработка = Ложь;
			ОткрытьФорму("БизнесПроцесс." + ИмяПроцесса + ".ФормаОбъекта", Новый Структура("Ключ", Процесс), ВладелецФормы);
			
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры


&НаКлиенте
Процедура Обновить(Команда)
	
	ОбновитьПараметрыВремени();
	Элементы.Список.Обновить();
	
КонецПроцедуры


&НаКлиенте
Процедура ВвестиПлатежноеПоручениеВходящее(Команда)
	
	текДок = Элементы.Список.ТекущаяСтрока;
	Если текДок <> Неопределено Тогда
		
		ОткрытьФорму("Документ.ПлатежноеПоручениеВходящее.ФормаОбъекта", Новый Структура("Основание", текДок));
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ВвестиПриходныйКассовыйОрдер(Команда)
	
	текДок = Элементы.Список.ТекущаяСтрока;
	Если текДок <> Неопределено Тогда
		
		ОткрытьФорму("Документ.ПриходныйКассовыйОрдер.ФормаОбъекта", Новый Структура("Основание", текДок));
		
	КонецЕсли;
	
КонецПроцедуры


&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	Слежение.Записать("Открытие. Рабочие заказы", "ЖурналыДокументов.ЖурналЗаказов");
	
КонецПроцедуры


&НаКлиенте
Процедура ОбработкаОповещения(ИмяСобытия, Параметр, Источник)
	
	Если 	ИмяСобытия = СобытияСистемы.Событие_ЗаписанаЗадача() ИЛИ
			ИмяСобытия = СобытияСистемы.Событие_ИзмениласьЗагрузкаАвтомобиля() Тогда
			
		//ОбновитьОтображениеДанных();  КонецЕсли;
		Элементы.Список.Обновить(); КонецЕсли;
	
КонецПроцедуры
